Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/All150502--omegat.tmx
Source language: en_us
Languages: ja

source: The company combines a full range of services throughout the software development cycle including analysis, planning, implementation, use of solutions, support and maintenance services.
ja: 分析、企画、実装、ソリューション利用、サポート、メンテナンスなど、ソフトウェア開発サイクル全般を対象とするさまざまなサービスを組み合わせて提供しています。

source: The company develops Wi-Fi network transmission modules, environment detection modules, home furnishing intelligent control terminals, cloud platforms, and provides a mature, intelligent home appliances solution.
ja: Wi-Fi ネットワーク トランスミッション モジュール、環境検知モジュール、高度家財コントロール端末、クラウド プラットフォームなどを開発し、成熟した先進家電ソリューションを提供しています。

source: The company has been at the forefront of new open technologies.
ja: 同社は、常に新たなオープン テクノロジの最前線にいます。

source: The company has consistently worked at developing innovative technologies and was the first automaker to mass-produce a twin-rotor rotary engine-powered vehicle.
ja: 革新的技術の開発に日々取り組み、2ローターロータリー エンジン車の大量生産を実現した初めての自動車メーカーです。

source: The company has invented and reinvented ways which the world stays connected and accesses information.
ja: 世界中が繋がり、情報にアクセスできる方法を発明・改革しています。

source: The company joins other Platinum members represented on the board that include Fujitsu, HP, IBM, Intel, NEC, Oracle, Qualcomm and Samsung.
ja: The Linux Foundation プラチナ メンバーには、同社のほか富士通、HP、IBM、Intel、日本電気、Oracle、Qualcomm、サムスン電子が名を連ねています。

source: The company provides financial services through Ford Motor Credit Company.
ja: フォード モーター クレジット カンパニー (Ford Motor Credit Company) による金融サービスも提供しています。

source: The company said it will open source its programming language Swift and allow developers to compile programs on Linux.
ja: 同社は、プログラミング言語 Swift をオープン ソース化して開発者が Linux 上でコンパイルできるようにすると言ったのです。

source: The core business focus is on open source virtualization solutions and custom services for complex mixed criticality automotive, NFV networking infrastructures, consumer electronics, mobile devices and in general, for embedded heterogeneous multicore systems around new generation processor architectures (i.e. ARMv8, etc.).
ja: 同社の主業務は、複雑なミックスド クリティカリティ (さまざまな重大度が混在している) 自動車機器、NFV ネットワーク基盤、消費者家電、スマートフォン、および新世代のプロセッサ アーキテクチャ (ARMv8 など) の周辺に通常組み込まれているヘテロジニアスなマルチコア システム向けのオープン ソース仮想化ソリューションとカスタム サービスです。

source: The criteria is also meant to encourage open source software (OSS) projects to take positive steps with both in mind and to help users know which projects are taking these positive steps.
ja: このような基準を設けることで、オープン ソース ソフトウェア (OSS) プロジェクトは積極的にセキュリティと品質を念頭に置くようになり、ユーザーにもどのプロジェクトがそのように積極的に取り組んでいるかがよくわかります。

source: The displays will be visible during the hours listed below.
ja: 展示時間は以下のとおりです。

source: The distributed ledger is a permanent, secure tool that makes it easier to create cost-efficient business networks without requiring a centralized point of control.
ja: 分散レジャーは、集中管理点を必要とせず、コスト効率のよい業務ネットワークを簡単に構築できる永続的かつセキュアなツールです。

source: The driving use case for this feature is live migration of virtualized guests; the migration system can move individual pages as needed in response to faults.
ja: 想定される使用例は、仮想化ゲストのライブ マイグレーション。ページ フォルト時にマイグレーション システムが必要に応じて個々のページを移動できます。

source: The effort includes representatives from more than 20 organizations—software, systems and tool vendors, foundations and systems integrators—all committed to creating a specification for software package data exchange formats.
ja: この取り組みには、ソフトウェア パッケージ データ交換フォーマット作成に賛同する 20 以上の団体 (ソフトウェア/システム/ツール ベンダー、標準化組織、財団、システム インテグレーターなど) の代表者が参加しています。

source: The effort should improve the effectiveness of Linux performance testing tools.
ja: その取り組みにより、Linux パフォーマンス テスト ツールがより効果的なものになるはずです。

source: The file types have been expanded, allowing for more precise identification of a file.
ja: ファイル タイプが拡張されたため、より正確にファイルを特定できるようになった。

source: The final episode is titled “Free Burger” and features Linux creator Linus Torvalds: https://youtu.be/CE4WeUNFX2g.
ja: ファイナル エピソードは "Free Burger" (フリー バーガー) というタイトルで、Linux 創始者の Linus Torvalds を特集しています。 https://youtu.be/CE4WeUNFX2g

source: The first draft of the criteria is available on GitHub and is spearheaded by David A. Wheeler, an open source and security research expert who works for the Institute for Defense Analyses (IDA) and is also coordinating the CII’s Census Project, and Dan Kohn, a senior adviser on the CII.
ja: 審査基準の最初の草案は GitHub で公開されており、David A. Wheeler (Institute for Defense Analyses (IDA) 在籍のオープン ソースとセキュリティ リサーチのエキスパートで、CII の Census Project も取りまとめている) と Dan Kohn (CII のシニア アドバイザー) が指揮をとります。

source: The focus of the 2016 event will be on enabling the understanding of the open networking landscape and how it advances SDN and NFV through pragmatic use-cases, making ONS the ideal forum for companies to share their thought leadership positions and production innovations in the area of open source networking.
ja: 2016 年のイベントは、オープン ソース ネットワーキングの現状理解の実現や、実際的ユースケースによる SDN/NFV の進化のようすなどをテーマに、ONS をオープン ソース ネットワーキング分野におけるソート リーダーシップやプロダクション イノベーションを企業が共有できる理想的な場にします。

source: The full roster of founding and new member organizations committed to CNCF include: Apcera, Apprenda, AT&T, Box, Centrify, Cisco, Cloudsoft, ClusterHQ, Container Solutions, CoreOS, Cycle Computing, Datawise.io, Deis, Inc./Engine Yard, Docker, eBay, Eldarion, Fujitsu, Goldman Sachs, Google, Huawei, IBM, iguaz.io, Infoblox, Intel, ISHI Systems, Joyent, Kismatic, Mesosphere, Metaswitch Networks (Project Calico), NCSOFT, NEC, NetApp, NGINX, Odin, Portworx, Rancher Labs, Red Hat, RX-M, LLC, Scalock, Software Engineering Lab of Zhejiang University, Switch SUPERNAP, Sysdig, Twistlock, Twitter, Univa Corporation, VMware, Weaveworks and Williams Garcia.
ja: CNCF を支持する創設メンバーおよび新規参入メンバー企業は、以下のとおりです。 Apcera, Apprenda, AT&T, Box, Centrify, Cisco, Cloudsoft, ClusterHQ, Container Solutions, CoreOS, Cycle Computing, Datawise.io, Deis, Inc./Engine Yard, Docker, eBay, Eldarion, Fujitsu, Goldman Sachs, Google, Huawei, IBM, iguaz.io, Infoblox, Intel, ISHI Systems, Joyent, Kismatic, Mesosphere, Metaswitch Networks (Project Calico), NCSOFT, NEC, NetApp, NGINX, Odin, Portworx, Rancher Labs, Red Hat, RX-M, LLC, Scalock, Software Engineering Lab of Zhejiang University, Switch SUPERNAP, Sysdig, Twistlock, Twitter, Univa Corporation, VMware, Weaveworks, Williams Garcia

source: The garden possesses numerous historic sites, such as the three-story pagoda, the sacred tree (said to be 500 years old), Han'nya-Ji style stone lanterns, the Koshin tower, the Shiratama Inari shrine, and the Seven Deities of Good Fortune, to name a few.
ja: 庭園には、三重塔、ご神木 (樹齢 500 年と言われる)、般若寺式石燈籠、庚申塔、 白玉稲荷神社、七福神など、さまざまな史跡が眠ります。

source: The goal of the Open Compliance Summit is to increase collaboration among summit participants in the area of open source legal compliance via:
ja: Open Compliance Summit はオープン ソースのリーガル/コンプライアンスに関わる人々が参加し、以下のような活動を通してコラボレーションを強化するイベントです。

source: The goal of this conference is to bring the latest trends in open source industry to Japan to raise the level of understanding on the value of usesing open seouce as well asll participating to them.
ja: このカンファレンスの目標は、オープン ソース業界の最新トレンドを日本に紹介してその利用意義に対する理解度を高め、利用企業を増やすことです。

source: The good news is that quite a bit of development effort has gone into solving this problem over the course of the last year.
ja: しかし喜ばしいことに、数々の開発努力によって昨年からこの問題が解決されつつあります。

source: The hotel is also a 3-minute taxi ride or a 10-minute walk from Edogawabashi Station on the Tokyo Metro Yurakucho line.
ja: 東京メトロ有楽町線の江戸川橋駅からタクシーで 3 分、または徒歩約 10 分です。

source: The improved syntax makes it much easier and more reliable to capture complex licensing in a file.
ja: 文法の改良により、1 つのファイルに混在するライセンスを簡単かつ確実に特定できるようになった。

source: The increased financial commitment will go primarily toward software development activities within the AGL open source project.
ja: このようにして強化された投資は、AGL オープン ソフトウェア プロジェクトのソフトウェア開発活動に生かされます。

source: The industry is now at the turning point!
ja: この業界は今、岐路に立っています!

source: The industry is wrestling with performance, security and scalability as it operationalizes new cloud, SDN and NFV technologies—the very areas IO Visor is aiming to address.
ja: 新たなクラウド、SDN、および NVF 技術 (まさに IO Visor が対応しようとしている領域) の運用を可能にするために、この業界はパフォーマンス、セキュリティ、およびスケーラビリティと戦っています。

source: The intent to form the Cloud Native Computing Foundation (CNCF) was announced earlier this year at OSCON to support development in a cloud native environment.
ja: Cloud Native Computing Foundation (CNCF) 結成の目的は、今年 OSCON にて発表されたように、クラウド ネイティブ環境における開発をサポートすることです。

source: The intent to form the Node.js Foundation was announced earlier this year with the purpose of supporting the ongoing growth and evolution of the Node.js platform, while maintaining a collaborative environment to benefit all.
ja: Node.js Foundation 結成の趣旨については今年すでに発表されており、その目的は、誰もがメリットを受けられる協業環境を保ちつつ、 Node.js プラットフォームの継続的成長と進化を支援するというものです。

source: The kernel address sanitizer (KASan) is an important new development tool for ensuring that the kernel is not accessing memory that it shouldn't.
ja: カーネル アドレス サニタイザー (kernel address sanitizer: KASan) は重要な新しい開発ツールで、アクセスしてはいけないメモリをカーネルがアクセスしないようにします。

source: The kernel now has support for GENEVE virtualization-encapsulation tunnels.
ja: GENEVE http://tools.ietf.org/html/draft-gross-geneve-02 仮想化カプセル化トンネルのサポート。

source: The kernel now supports the attachment of BPF programs to uprobes, making more flexible tracing of user-space code possible.
ja: uprobes https://lwn.net/Articles/499190/ への BPF プログラムのアタッチメントをサポート ユーザースペース コードをより柔軟にトレースできるようになります。

source: The kernel's support for large nonvolatile memory devices has improved considerably.
ja: 大規模な不揮発性メモリ デバイスに対するサポートが大幅に改善されました https://lwn.net/Articles/610174/。

source: The lazytime mount option allows for more efficient and accurate tracking of file access times.
ja: lazytime マウント オプション https://lwn.net/Articles/621046/ により、ファイル アクセス時間のより効率的で正確な追跡を実現。

source: The lines between open source and proprietary software are blurring.
ja: オープン ソースとプロプライエタリ ソフトウェアの境界がぼやけ始めています。

source: The list will be finalized approximately (2) weeks prior to the conference and will be emailed to sponsors at that time.
ja: プレス リストはカンファレンスの約2週間前に完成し、スポンサーに電子メールで配信されます。

source: The major-number change for this release does not carry any information other than the 3.x minor numbers were getting too large.
ja: このリリースのメジャー番号が変更された理由は、単に 3.x のマイナー番号が大きくなりすぎたからだと言われています。

source: The member roster for the Node.js Foundation is quite impressive and demonstrates the importance of these code bases.
ja: Node.js Foundation のメンバーの素晴らしい顔ぶれを見れば、そのコード ベースの重要性がわかるでしょう。

source: The merge window for this release has closed, and the feature set is complete.
ja: このリリースのマージ ウィンドウは現在クローズされていますので、機能セットは完成しています。

source: The merging of the control group writeback patches should greatly improve memory-management performance, especially on systems where memory control groups are in use.
ja: control group のライトバック パッチのマージ。 特に memory control group を使用しているシステムで、メモリ管理パフォーマンスが大幅に改善されます。

source: The mlock2() system call, which allows a process to lock a region in memory without faulting in all of the relevant pages at the beginning.
ja: mlock2() システム コール https://lwn.net/Articles/650538/ その時点で関連するすべてのページでページ フォルトを起こすことなくメモリ内のある領域をロックできます。

source: The model includes a Technical Oversight Committee (TOC) that will direct technical decisions, oversee working group projects and manage contributions to the code base.
ja: このモデルには、技術的な決定を主導し、ワーキング グループ プロジェクトを監督し、コード ベースの貢献を管理する技術管理委員会 (Technical Oversight Committee: TOC) が含まれています。

source: The model includes a Technical Steering Committee that will direct technical decisions, oversee working group projects and manage contributions to the node code base, and a Board of Directors to guide business decisions.
ja: このモデルには、技術的な決定を主導し、ワーキング グループ プロジェクトを監督し、基盤ノード コードへの貢献を管理する技術運営委員会と、事業的な決定を主導する理事会が含まれています。

source: The more you share, the more you benefit.
ja: 多くを共有することは、多くを得ることです。

source: The most obvious solution is for the two projects to come together more closely.
ja: 理想的なソリューションは、この 2 つのプロジェクトがさらに緊密に協力することなのです。

source: The multi-million dollar project is organized by The Linux Foundation and supported by Amazon Web Services, Adobe, Bloomberg, Cisco, Dell, Facebook, Fujitsu, Google, Hitachi, HP, Huawei, IBM, Intel, Microsoft, NetApp, NEC, Qualcomm, RackSpace, Salesforce, and VMware.
ja: この数百万ドル規模プロジェクトは、Linux Foundation によって組織され、Amazon Web Services、Adobe、Bloomberg、Cisco、Dell、Facebook、富士通、Google、日立、HP、Huawei、IBM、Intel、Microsoft、NetApp、日本電気、Qualcomm、RackSpace、salesforce、および VMware によって支援されています。

source: The multi-million dollar project is organized by The Linux Foundation and supported by Amazon Web Services, Adobe, Bloomberg, Cisco, Dell, Facebook, Fujitsu, Google, Hitachi, HP, Huawei, IBM, Intel, Microsoft, NetApp, NEC, Qualcomm, RackSpace, salesforce.com, and VMware.
ja: この数百万ドル規模プロジェクトは、Linux Foundation によって組織され、Amazon Web Services、Adobe、Bloomberg、Cisco、Dell、Facebook、富士通、Google、日立、HP、Huawei、IBM、Intel、Microsoft、NetApp、日本電気、Qualcomm、RackSpace、salesforce.com、および VMware によって支援されています。

source: The new Collaborative Project will advance and bring together the community for ONOS to build open source platforms, solutions and ecosystem for service providers to monetize SDN/NFV, while helping vendors and service providers invent new business models.
ja: この新しい協業プロジェクトは、サービス プロバイダーが SDN/NFV を収益化できるよう、ONOS のコミュニティによるオープン ソース プラットフォーム、ソリューション、およびエコシステムの構築を促進奨励し、ベンダーやサービス プロバイダーが新しいビジネス モデルを生み出せるよう支援します。

source: The new delay-gradient congestion-control algorithm has been merged; this is an interesting new approach to getting the most out of available bandwidth without causing problems for the net as a whole.
ja: 新しい delay-gradient congestion-control (遅延勾配輻輳制御) アルゴリズムのマージ。 全体的にネットに問題を与えずに利用可能な帯域幅を最大限に利用するという興味深い新手法です。

source: The new functionality builds on AllJoyn’s existing end-to-end data encryption and message-based security, adding rich semantics that extend familiar security models from the cloud and app domain to the devices that make up the IoT.
ja: 新機能は AllJoyn の既存の エンドツーエンド データ暗号化とメッセージベース セキュリティの上にビルドされ、使い慣れたセキュリティ モデルを IoT の構成要素であるクラウドやアプリ ドメインからデバイスまで拡張できるリッチなセマンティクスが加わっています。

source: The nominations are currently open for TOC members and we encourage everyone to get involved; see the cncf-toc mailing list for more information.
ja: 現在 TOC メンバーの候補を受け付けていますので、興味のある方はぜひご応募ください。詳細については、cncf-toc メーリング リストでご確認ください。

source: The open governance model for R Consortium includes an infrastructure steering committee that will direct technical decisions and oversee working group projects and a board of directors to guide business decisions.
ja: R Consortium のオープン ガバナンス モデルには、技術的な決定を主導したり、ワーキング グループ プロジェクトを監督したりする基盤運営委員会と、事業的な決定を主導する理事会があります。

source: The open, technical governance model that will guide the project was determined with input from the public, including contributors from both the Node.js and io.js communities.
ja: プロジェクトの指針となるそのオープンな技術ガバナンス モデルは、Node.js コミュニティと io.js コミュニティのコントリビューターなどの協力を得て決定されました。

source: The organization is also working with other Linux Foundation Collaborative Projects, such as the Open Container Initiative, which is establishing the industry standard for container image specification and runtime, and the Cloud Foundry Foundation.
ja: また、コンテナ イメージの仕様やランタイムの業界標準を確立しようとしている Open Container Initiative などの Linux Foundation 協業プロジェクトや、Cloud Foundry Foundation とも連携します。

source: The organization will also work with the recently announced Open Container Initiative on its container image specification.
ja: また、コンテナ イメージの使用に関しては最近発表された Open Container Initiative とも連携します。

source: The persistent memory block driver, providing basic access to non-volatile RAM devices.
ja: 不揮発性メモリ ブロック ドライバー http://lwn.net/SubscriberLink/640113/f72ab27248369c7c/。 不揮発性 RAM デバイスへの基本アクセスが可能になります。

source: The project will develop an enterprise grade, open source distributed ledger framework and free developers to focus on building robust, industry-specific applications, platforms and hardware systems to support business transactions.
ja: 同プロジェクトは、商取引を支える堅牢な業界専門アプリケーション、プラットフォーム、およびハードウェア システムの構築をめざし、企業グレードのオープン ソース分散型台帳 (分散レジャー: distributed ledger) フレームワークとその開発者を育成します。

source: The property consists of three buildings: the hotel, the plaza and the tower; and a traditional-style Japanese garden.
ja: 椿山荘は、ホテル、プラザ、タワーの 3 つの建物と、伝統的な日本庭園とで構成されています。

source: The public beta is a critical milestone, in that website administrators no longer need to pay for certificates or deal with the hassles of renewal and manual updates.
ja: 公開ベータ版のリリースは重要なマイルストーンです。これによって Web サイト管理者はもう証明書にお金を払ったり、更新や手動アップデートのたびに悩む必要がなくなります。

source: The questionnaire asks if a project includes an OSS license; a public version-controlled source repository; a general mailing list; an automated regression test suite; and at least one static analysis tool applied to source code to look for vulnerabilities.
ja: アンケートの内容は、プロジェクトが以下のようなものを含んでいるかどうかを尋ねています。 OSS のライセンス、パブリックのバージョン管理されたソース リポジトリ、一般的なメーリング リスト、自動リグレッション テスト スイート、およびソース コードの脆弱性を見つけるための 1 つ以上の静的解析ツール。

source: The registration to this event will be opned up very soon!
ja: このイベントの登録については、まもなくオープンの予定です。

source: The relationship view of license dependencies is made possible through new features that include a deeper level of description and context in files and packages, including those external to the SPDX specification.
ja: また、ファイルやパッケージに詳細レベルの説明やコンテキストが含まれているので (SPDX 仕様外のものも)、ライセンスの依存関係がよくわかります。

source: The remap_file_pages() system call has been removed.
ja: remap_file_pages() システム コールの削除。

source: The reservation sheet will be available at the Registration/Information Desk during conference hours.
ja: 会議室をご利用になる場合は、会場の受付で予約してください。

source: The result is the industry’s most complete IoT framework with built-in security.
ja: その結果、

source: The result will be a safer and more secure Internet for all of us.
ja: つまり誰もがより安全に、安心してインターネットを使えるようになるのです。

source: The risk, of course, is that we end up with a community fractured among a panoply of competing architectures.
ja: もちろん、コミュニティが一連の競合するアーキテクチャで分裂する危険性もあります。

source: The schedule of this event will be coming up soon!
ja: このイベントのスケジュールについては、まもなく発表の予定です。

source: The second new CII advisory board member is Tom Ritter, Practice Director of Cryptography Services, part of NCC Group, where he performs application penetration testing and cryptographic analysis for multiple platforms and environments.
ja: 2 人めの新しい CII アドバイザリ ボード メンバーは、NCC Group の Cryptography Services のプラクティス ディレクターである Tom Ritter です。彼は同社でさまざまなプラットフォームや環境に対するアプリケーション脆弱性テストや暗号法解析を実行しています。

source: The self-assessment, and the badges that will follow, are designed to be a simple, fairly basic way for projects to showcase their commitment to security and quality.
ja: 自己評価とそれに伴うバッジは、プロジェクトがセキュリティと品質へのコミットメントを表すシンプルでごく基本的な方法になるよう設計されています。

source: The series follows characters Annie, Sam and String as they navigate music, social connections, movies, road trips and even space explorations in the imaginary world without Linux.
ja: このシリーズには、Annie、Sam、String というキャラクターが登場し、Linux のない仮想世界の音楽、社会とのつながり、映画、ドライブ、宇宙探検などを経験します。

source: The series was originally launched on October 5, 2015 at LinuxCon Europe.
ja: このシリーズの第一弾が公開されたのは 2015 年 10 月 5 日の LinuxCon Europe でした。

source: The summit provides a neutral environment for participants from different companies and different backgrounds to:
ja: このサミットでは、異なるバックグラウンドを持つさまざまな企業の人々が、中立な環境のもとで、以下のような機会を持つことができます。

source: The technical details are still important, but the relevance of what you are presenting will help the program committee during the selection process.
ja: プログラム コミッティが発表内容を審査する際は、その技術的な詳細を重視するのはもちろんですが、発表の妥当性も評価します。

source: The theory was that security was something that users wanted from banks and eCommerce and perhaps their email provider, but not from regular sites.
ja: なぜならセキュリティとはユーザーが銀行や通販サイトや e メール プロバイダーに求めるものであって、通常のサイトに求めるものではなかったのです。

source: The venerable ext3 filesystem has been removed.
ja: 伝統ある ext3 ファイルシステムの削除

source: The winners, above all, are SysAdmins.
ja: いずれにしても勝者は SysAdmin たちです。

source: The work of many of these workgroups may eventually become best practice and codified into the Linux Standard Base and/or may be submitted as patches to the mainline kernel tree or other packages.
ja: これらの多くのワークグループの活動からベスト プラクティスが生まれ、Linux Standard Base として体系化されたり、カーネル ツリーのメインラインやその他パッケージにパッチとして提出されたりします。

source: The work we do with the Linux and open source community is a strategic way we build Huawei ICT software infrastructure,” said Mr. Ti Gong, the President of Central Software Institute, Huawei.
ja: 弊社と Linux / オープン ソース コミュニティとの連携作業は、Huawei ICT ソフトウェア基盤を構築するための戦略的手段です。

source: The workgroup will bring together developers and users to standardize on interfaces and common exchange formats.
ja: 同ワークグループは、開発者やユーザーを結集してインターフェースや共通交換フォーマットを標準化します。

source: The world's largest open source initiative to advance the Internet of Things
ja: Internet of Everything を推進する世界最大のオープン ソース イニシアチブ

source: There are a limited number of rooms available at this rate, so we encourage attendees to book early.
ja: 部屋数には限りがありますので、お早めのご予約をお勧めします。

source: There are plenty of ways to give a presentation about projects and technologies without focusing on company-specific efforts.
ja: 企業独自の活動にフォーカスしないで、プロジェクトや技術情報に関する発表を行う方法はたくさんあります。

source: There are several patch sets out there, but there are still significant disagreements over how this problem should be solved.
ja: いくつかのパッチセットが存在しますが、この問題の解決方法についてはまだ大きな意見の相違が見られます。

source: There are teams in our community already working on replacing parts of the ONOS code base with code from OpenDaylight to allow end users to meet critical needs such as the ability to manage multiple different hardware types through a range of southbound protocols.
ja: また私たちのコミュニティには、エンド ユーザーがクリティカルなニーズ (さまざまなサウスバウンド プロトコルの各種ハードウェアを管理するなど) に対応できるように、ONOS コード ベースの一部を OpenDaylight のコードに置き換える取り組みを行っているチームもあります。

source: There has been much gnashing of teeth about the out-of-tree Android patches over the years.
ja: 長年の間、ツリーに入らない Android パッチに関する不満が山積していました。

source: There is a commonly held philosophy among open source contributors and developers that the best ideas result from disagreement and smart people discussing the merits of decisions and, of course, code.
ja: オープン ソースの貢献者や開発者らの間には、「最良のアイデアは、論争と、意思決定のメリットを議論する賢明な人々と、(そしてもちろん) コードによって生まれる」という共通の哲学が存在します。

source: There is also an End User Advisory Board and Board of Directors to guide business decisions and ensure alignment between the technical and end user communities.
ja: また、業務上の決定指南や、技術コミュニティとエンド ユーザー コミュニティとの調整を行うエンド ユーザー アドバイザリ ボードや理事会も存在します。

source: There is no secret any more that Linux and other open source software runs the business all across the world, and in 2015 we have been seeing even futher growth of open source in terms of the industry segments they are used, such as IoT, automotive, aerospace and more, as well as the amount of codes contributed from those new industry to open source upstream projects.
ja: Linux などのオープン ソース ソフトウェアが世界中のビジネスを動かしていることはもはや公然の事実ですが、2015 年はさらに IoT、自動車、航空宇宙などの分野でもオープン ソースの使用が広がりを見せ、これらの新分野からオープン ソース アップストリーム プロジェクトへのコード貢献も増えています。

source: There is still work to be done to get to a fully featured live-patching system, but the foundation is there in 4.0.
ja: ライブパッチ システムが完全に機能するためにはまだやるべきこと https://lwn.net/Articles/634649/ が残っていますが、4.0 でその基礎ができます。

source: There were 12,274 changes merged during the 4.3 development cycle; see this article for some information on where that work came from.
ja: カーネル 4.3 の開発サイクルでは 12,274 件の変更がマージされました。パッチの作成者については、こちらの記事 (https://lwn.net/Articles/661978/) を参照してください。

source: There will be opportunities for broad participation as corporate members join the Foundation, Board Directors are elected and plans for Individual Members roll out.
ja: メンバー企業が同財団に参加し、ボード ディレクターが選出され、そして個人メンバーのプランが公開されるなどすると、さらに多くの参加機会が生まれるでしょう。
